工具使用/工作工具/编程语言/javascript/nodejs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-09 三 12:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Node.js 简介</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="wuming" />
<meta name="description" content="Node.js 简介"
 />
</head>
<body>
<div id="content">
<h1 class="title">Node.js 简介</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga1678fe">0.1. 安装</a>
<ul>
<li><a href="#orgdef1818">0.1.1. nvm</a></li>
</ul>
</li>
<li><a href="#org0832663">0.2. 模块</a>
<ul>
<li><a href="#orgf09bd28">0.2.1. 原生语法 (import/export)</a></li>
<li><a href="#org8e0dd7a">0.2.2. 库所支持的语法</a></li>
</ul>
</li>
<li><a href="#orgac1c1dc">0.3. 全局变量</a></li>
<li><a href="#org7ccc928">0.4. 常用内置模块</a>
<ul>
<li><a href="#orga716c4a">0.4.1. path 模块</a></li>
<li><a href="#org78ee0d8">0.4.2. fs 模块</a></li>
<li><a href="#org0ebb2cb">0.4.3. http 模块</a></li>
<li><a href="#org869bfba">0.4.4. events 模块</a></li>
<li><a href="#orga7effec">0.4.5. url 模块</a></li>
<li><a href="#orgd266fbf">0.4.6. Buffer 类</a></li>
<li><a href="#orgd4e978f">0.4.7. util 模块</a></li>
<li><a href="#org5be9917">0.4.8. OS 模块</a></li>
<li><a href="#org31e375d">0.4.9. Net 模块</a></li>
<li><a href="#org3f42527">0.4.10. DNS 模块</a></li>
<li><a href="#org6d78de7">0.4.11. Domain 模块</a></li>
<li><a href="#org2857ad5">0.4.12. Web 模块</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org435948d">1. npm</a></li>
<li><a href="#org80ccf11">2. 调试刷新</a>
<ul>
<li><a href="#org2077042">2.1. 刷新 supervisor</a></li>
<li><a href="#org0faf317">2.2. 调试 node debug</a></li>
<li><a href="#org00a8f15">2.3. 远程调试</a></li>
</ul>
</li>
<li><a href="#orga825631">3. Express 框架</a></div>
</div>
<p>
Node.js 既是一个 JavaScript 运行时环境，又是一个库
</p>

<blockquote>
<p>
<b>Node.js</b> 使用了谷歌的 <b>V8</b> JavaScript 解析器，而且没有浏览器对安全的限制，所以扩展了很多的库 (文件操作，网络操作，进程操作等)
</p>
</blockquote>

<blockquote>
<p>
特点是异步操作，因为 <b>web</b> 程序耗时于 <b>IO</b> 操作，不便同步，nodejs 放大了这个特点，所以性能很好
</p>
</blockquote>

<div id="outline-container-orga1678fe" class="outline-3">
<h3 id="orga1678fe"><span class="section-number-3">0.1</span> 安装</h3>
<div class="outline-text-3" id="text-0-1">
<p>
安装 <b>node</b> 即可
</p>
</div>
<div id="outline-container-orgdef1818" class="outline-4">
<h4 id="orgdef1818"><span class="section-number-4">0.1.1</span> nvm</h4>
<div class="outline-text-4" id="text-0-1-1">
<p>
对于多个版本，可以安装 <b>nvm</b> 版本管理工具，用来管理 node 的版本 
</p>
<ul class="org-ul">
<li>安装最新 node  nvm install node</li>
<li>安装某个版本  nvm install 6.14.4</li>
<li>使用某个版本 nvm use v10.1.1</li>
<li>列出版本  nvm ls</li>
<li>列出远程 node 版本   nvm ls-remote</li>
<li>卸载 nvm uninstall</li>
<li>安装最近版本的 npm  nvm install-latest-npm</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org0832663" class="outline-3">
<h3 id="org0832663"><span class="section-number-3">0.2</span> 模块</h3>
<div class="outline-text-3" id="text-0-2">
<p>
本来 <b>javascript</b> 刚开发的时候是做为脚本使用的，代码量少，所以没有提供模块。现在脚本复杂了，就引入了模块的概念
</p>
</div>
<div id="outline-container-orgf09bd28" class="outline-4">
<h4 id="orgf09bd28"><span class="section-number-4">0.2.1</span> 原生语法 (import/export)</h4>
<div class="outline-text-4" id="text-0-2-1">
<p>
定义模块并导出模块的功能
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7; font-weight: bold;">export</span> <span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">name</span> = <span style="color: #2d9574;">'square'</span>;
</pre>
</div>

<p>
导入功能到你的脚本
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #4f97d7;">{</span> name, draw, reportArea, reportPerimeter <span style="color: #4f97d7;">}</span> from <span style="color: #2d9574;">'/js-examples/modules/basic-modules/modules/square.mjs'</span>;
</pre>
</div>

<p>
应用模块到你的 HTML
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #bc6ec5; font-weight: bold;">script</span> <span style="color: #7590db;">type</span>=<span style="color: #2d9574;">"module"</span> <span style="color: #7590db;">src</span>=<span style="color: #2d9574;">"main.mjs"</span>&gt;&lt;/<span style="color: #bc6ec5; font-weight: bold;">script</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org8e0dd7a" class="outline-4">
<h4 id="org8e0dd7a"><span class="section-number-4">0.2.2</span> 库所支持的语法</h4>
<div class="outline-text-4" id="text-0-2-2">
</div>
<ol class="org-ol">
<li><a id="org0c6a973"></a>node<br />
<ol class="org-ol">
<li><a id="org18c9a7c"></a>导出<br />
<div class="outline-text-6" id="text-0-2-2-1-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #7590db;">name</span>=<span style="color: #4f97d7;">{</span>
    sayHello<span style="color: #bc6ec5;">(){</span>
        console.log<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"hello"</span><span style="color: #2d9574;">)</span>
    <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>

module.exports=name 
</pre>
</div>
</div>
</li>
<li><a id="org0644549"></a>引入<br />
<div class="outline-text-6" id="text-0-2-2-1-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #7590db;">module</span>=require<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"MODULEPATH"</span><span style="color: #4f97d7;">)</span>;
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
<div id="outline-container-orgac1c1dc" class="outline-3">
<h3 id="orgac1c1dc"><span class="section-number-3">0.3</span> 全局变量</h3>
<div class="outline-text-3" id="text-0-3">
<ul class="org-ul">
<li>_<sub>dirname</sub>：当前文件的目录</li>
<li>_<sub>filename</sub>：当前文件的绝对路径</li>
<li>console：控制台对象，可以输出信息</li>
<li>process：进程对象，可以获取进程的相关信息，环境变量等</li>
<li>setTimeout/clearTimeout：延时执行</li>
<li>setInterval/clearInterval：定时器</li>
</ul>
</div>
</div>

<div id="outline-container-org7ccc928" class="outline-3">
<h3 id="org7ccc928"><span class="section-number-3">0.4</span> 常用内置模块</h3>
<div class="outline-text-3" id="text-0-4">
</div>
<div id="outline-container-orga716c4a" class="outline-4">
<h4 id="orga716c4a"><span class="section-number-4">0.4.1</span> path 模块</h4>
<div class="outline-text-4" id="text-0-4-1">
<blockquote>
<p>
path 模块供了一些工具函数，用于处理文件与目录的路径
</p>
</blockquote>

<ul class="org-ul">
<li>path.basename：返回一个路径的最后一部分</li>
<li>path.dirname：返回一个路径的目录名</li>
<li>path.extname：返回一个路径的扩展名</li>
<li>path.join：用于拼接给定的路径片段</li>
<li>path.normalize：将一个路径正常化</li>
</ul>
</div>
</div>

<div id="outline-container-org78ee0d8" class="outline-4">
<h4 id="org78ee0d8"><span class="section-number-4">0.4.2</span> fs 模块</h4>
<div class="outline-text-4" id="text-0-4-2">
<p>
文件操作相关的模块
</p>

<ul class="org-ul">
<li>fs.stat/fs.statSync：访问文件的元数据，比如文件大小，文件的修改时间</li>
<li>fs.readFile/fs.readFileSync 异步/同步读取文件</li>
<li>fs.writeFile/fs.writeFileSync 异步/同步写入文件</li>
<li>fs.readdir/fs.readdirSync：读取文件夹内容</li>
<li>fs.unlink/fs.unlinkSync：删除文件</li>
<li>fs.rmdir/fs.rmdirSync：只能删除空文件夹，思考：如何删除非空文件夹？</li>
<li>fs.watchFile：监视文件的变化</li>
</ul>

<p>
stream 操作大文件
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#35835;&#21462;&#22823;&#25991;&#20214;</span>
<span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #7590db;">readStream</span> = fs.createReadStream<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"ideaIU-2018.1.5.win.zip"</span><span style="color: #4f97d7;">)</span>;
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#20889;&#20837;&#22823;&#25991;&#20214;</span>
<span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #7590db;">writeStream</span> = fs.createWriteStream<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"a.zip"</span><span style="color: #4f97d7;">)</span>;
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">let len = 0;</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">readStream.on("data", (chunk) =&gt; {</span>
<span style="color: #2aa1ae; background-color: #292e34;">//     </span><span style="color: #2aa1ae; background-color: #292e34;">len += chunk.length</span>
<span style="color: #2aa1ae; background-color: #292e34;">//     </span><span style="color: #2aa1ae; background-color: #292e34;">// console.log(chunk.length)</span>
<span style="color: #2aa1ae; background-color: #292e34;">//     </span><span style="color: #2aa1ae; background-color: #292e34;">writeStream.write(chunk)</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">})</span>
<span style="color: #2aa1ae; background-color: #292e34;">//</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">readStream.on("end", () =&gt; {</span>
<span style="color: #2aa1ae; background-color: #292e34;">//     </span><span style="color: #2aa1ae; background-color: #292e34;">console.log("&#25991;&#20214;&#35835;&#21462;&#23436;&#25104;," + len)</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">})</span>

readStream.pipe<span style="color: #4f97d7;">(</span>writeStream<span style="color: #4f97d7;">)</span>    
</pre>
</div>
</div>
</div>

<div id="outline-container-org0ebb2cb" class="outline-4">
<h4 id="org0ebb2cb"><span class="section-number-4">0.4.3</span> http 模块</h4>
<div class="outline-text-4" id="text-0-4-3">
<p>
封装了 http server 和 client 的功能，就是说可以充当 server 处理请求，也可以发出请求。
</p>
</div>
</div>
<div id="outline-container-org869bfba" class="outline-4">
<h4 id="org869bfba"><span class="section-number-4">0.4.4</span> events 模块</h4>
<div class="outline-text-4" id="text-0-4-4">
<p>
监听并触发事件
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">EventEmitter</span> = require<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'events'</span><span style="color: #4f97d7;">)</span>.EventEmitter;
<span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">event</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">EventEmitter</span><span style="color: #4f97d7;">()</span>;
event.on<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'some_event'</span>, <span style="color: #4f97d7; font-weight: bold;">function</span><span style="color: #bc6ec5;">()</span> <span style="color: #bc6ec5;">{</span>
    console.log<span style="color: #2d9574;">(</span><span style="color: #2d9574;">'some_event &#20107;&#20214;&#35302;&#21457;'</span><span style="color: #2d9574;">)</span>;
<span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>;
setTimeout<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">function</span><span style="color: #bc6ec5;">()</span> <span style="color: #bc6ec5;">{</span>
    event.emit<span style="color: #2d9574;">(</span><span style="color: #2d9574;">'some_event'</span><span style="color: #2d9574;">)</span>;
<span style="color: #bc6ec5;">}</span>, <span style="color: #a45bad;">1000</span><span style="color: #4f97d7;">)</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-orga7effec" class="outline-4">
<h4 id="orga7effec"><span class="section-number-4">0.4.5</span> url 模块</h4>
</div>
<div id="outline-container-orgd266fbf" class="outline-4">
<h4 id="orgd266fbf"><span class="section-number-4">0.4.6</span> Buffer 类</h4>
</div>
<div id="outline-container-orgd4e978f" class="outline-4">
<h4 id="orgd4e978f"><span class="section-number-4">0.4.7</span> util 模块</h4>
<div class="outline-text-4" id="text-0-4-7">
<p>
util 是一个 Node.js 核心模块，提供常用函数的集合，用于弥补核心 JavaScript 的功能 过于精简的不足。
</p>
</div>
</div>

<div id="outline-container-org5be9917" class="outline-4">
<h4 id="org5be9917"><span class="section-number-4">0.4.8</span> OS 模块</h4>
<div class="outline-text-4" id="text-0-4-8">
<p>
提供了一些基本的系统操作函数。
</p>
</div>
</div>

<div id="outline-container-org31e375d" class="outline-4">
<h4 id="org31e375d"><span class="section-number-4">0.4.9</span> Net 模块</h4>
<div class="outline-text-4" id="text-0-4-9">
<p>
Node.js Net 模块提供了一些用于底层的网络通信的小工具，包含了创建服务器/客户端的方法
</p>
</div>
</div>
<div id="outline-container-org3f42527" class="outline-4">
<h4 id="org3f42527"><span class="section-number-4">0.4.10</span> DNS 模块</h4>
<div class="outline-text-4" id="text-0-4-10">
<p>
Node.js DNS 模块用于解析域名。
</p>
</div>
</div>
<div id="outline-container-org6d78de7" class="outline-4">
<h4 id="org6d78de7"><span class="section-number-4">0.4.11</span> Domain 模块</h4>
<div class="outline-text-4" id="text-0-4-11">
<p>
Node.js Domain(域) 简化异步代码的异常处理，可以捕捉处理 try catch 无法捕捉的异常。
</p>
</div>
</div>
<div id="outline-container-org2857ad5" class="outline-4">
<h4 id="org2857ad5"><span class="section-number-4">0.4.12</span> Web 模块</h4>
</div>
</div>
<div id="outline-container-org435948d" class="outline-2">
<h2 id="org435948d"><span class="section-number-2">1</span> npm</h2>
<div class="outline-text-2" id="text-1">
<p>
npm 是 一家 管理 <b>Javascript</b> 项目为主的公司，同名的 npm 软件可以用来管理 <b>js 项目</b> 。
</p>

<blockquote>
<p>
目录中包含以 * package.json*  作为文件名的项目一般视为 npm 项目，npm 中称呼为包。包中对其他项目的引用放在 <b>node<sub>modules</sub></b> 中，叫做依赖
</p>
<p>
这里包和项目是一个意思，有些地方说包，有些地方说模块，我喜欢用项目
</p>
</blockquote>

<p>
npm 功能
</p>
<ul class="org-ul">
<li>npm -v 显示版本号</li>
<li>npm init 新建项目</li>
<li>npm install 安装所有项目依赖</li>
<li>npm help 查看帮助信息</li>
<li>npm search 搜索项目信息</li>
<li>npm install 包名 (局部安装，安装在当前项目的 node<sub>modules</sub> 目录下)</li>
<li>-g 全局安装</li>
<li>-D 安装并将依赖信息写在 package.json 中的 devDependencies 中</li>
<li>npm uninstall 卸载包</li>
<li>npm list 列出已安装依赖</li>
<li>npm outdated 检查过期依赖</li>
<li>npm update 更新依赖</li>
<li>npm root 查看依赖安装路径（也就是 node<sub>modules</sub> 的路径）</li>
<li>npm view 查看模块的注册信息
<ul class="org-ul">
<li>xxx versions 列出 xxx 的所有版本</li>
<li><p>
xxx dependencies 列出 xxx 的所有依赖， 如：npm view gulp dependencies
</p>

<div class="org-src-container">
<pre class="src src-shell">npm install npm@latest -g
npm config set registry https://registry.npm.taobao.org
</pre>
</div>

<blockquote>
<p>
如果因为网络问题无法安装，可以使用 <b>cnpm</b> 安装
</p>
</blockquote></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org80ccf11" class="outline-2">
<h2 id="org80ccf11"><span class="section-number-2">2</span> 调试刷新</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org2077042" class="outline-3">
<h3 id="org2077042"><span class="section-number-3">2.1</span> 刷新 supervisor</h3>
<div class="outline-text-3" id="text-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">安装</td>
<td class="org-left">npm install -g supervisor</td>
</tr>

<tr>
<td class="org-left">使用</td>
<td class="org-left">supervisor app.js</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org0faf317" class="outline-3">
<h3 id="org0faf317"><span class="section-number-3">2.2</span> 调试 node debug</h3>
<div class="outline-text-3" id="text-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">run</td>
<td class="org-left">执行脚本,在第一行暂停</td>
</tr>

<tr>
<td class="org-left">restart</td>
<td class="org-left">重新执行脚本</td>
</tr>

<tr>
<td class="org-left">cont, c</td>
<td class="org-left">继续执行,直到遇到下一个断点</td>
</tr>

<tr>
<td class="org-left">next, n</td>
<td class="org-left">单步执行</td>
</tr>

<tr>
<td class="org-left">step, s</td>
<td class="org-left">单步执行并进入函数</td>
</tr>

<tr>
<td class="org-left">out, o</td>
<td class="org-left">从函数中步出</td>
</tr>

<tr>
<td class="org-left">setBreakpoint(), sb()</td>
<td class="org-left">在当前行设置断点</td>
</tr>

<tr>
<td class="org-left">setBreakpoint(‘f()’), sb(&#x2026;)</td>
<td class="org-left">在函数 f 的第一行设置断点</td>
</tr>

<tr>
<td class="org-left">setBreakpoint(‘script.js’, 20), sb(&#x2026;)</td>
<td class="org-left">在 script.js 的第 20 行设置断点</td>
</tr>

<tr>
<td class="org-left">clearBreakpoint, cb(&#x2026;)</td>
<td class="org-left">清除所有断点</td>
</tr>

<tr>
<td class="org-left">backtrace, bt</td>
<td class="org-left">显示当前的调用栈</td>
</tr>

<tr>
<td class="org-left">list(5)</td>
<td class="org-left">显示当前执行到的前后 5 行代码</td>
</tr>

<tr>
<td class="org-left">watch(expr)</td>
<td class="org-left">把表达式 expr 加入监视列表</td>
</tr>

<tr>
<td class="org-left">unwatch(expr)</td>
<td class="org-left">把表达式 expr 从监视列表移除</td>
</tr>

<tr>
<td class="org-left">watchers</td>
<td class="org-left">显示监视列表中所有的表达式和值</td>
</tr>

<tr>
<td class="org-left">repl</td>
<td class="org-left">在当前上下文打开即时求值环境</td>
</tr>

<tr>
<td class="org-left">kill</td>
<td class="org-left">终止当前执行的脚本</td>
</tr>

<tr>
<td class="org-left">scripts</td>
<td class="org-left">显示当前已加载的所有脚本</td>
</tr>

<tr>
<td class="org-left">version</td>
<td class="org-left">显示 V8 的版本</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org00a8f15" class="outline-3">
<h3 id="org00a8f15"><span class="section-number-3">2.3</span> 远程调试</h3>
<div class="outline-text-3" id="text-2-3">
<pre class="example">
node --debug[=port] script.js
node --debug-brk[=port] script.js
</pre>
</div>
</div>
</div>

<div id="outline-container-orga825631" class="outline-2">
<h2 id="orga825631"><span class="section-number-2">3</span> Express 框架</h2>
<div class="outline-text-2" id="text-3">
<p>
使用 Express 可以快速地搭建一个完整功能的网站
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-02-16T18:13:56+08:00</p>
<p class="author">Author: wuming</p>
<p class="date">Created: 2020-09-09 三 12:50</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
